
while True:
    print("R5 ожидает запроса")
    r = input()
    if r == "Привет!":
        print("Здраствуйте! Чем я могу вам помочь?")
    if r == "Привет":
        print("Здраствуйте!")
    if r == "Как тебя зовут?":
        print("Я R5")
    if r == "Как тебя зовут":
        print("Я R5")
    if r == "Имя":
        print("Я R5")
    if r == "Имя!":
        print("Я R5!")
    if r == "Кто тебя создал?":
        print("Меня создала мама")
    if r == "Кто тебя создал":
        print("Моя мама")
    if r == "Кто твоя мама?":
        print("студия S.P.Y")
    if r == "Кто твоя мама":
        print("студия S.P.Y")
    if r == "Как твои дела?":
        print("Когда общаюсь с вами отлично")
    if r == "Как твои дела":
        print("Всё хорошо")
    if r == "Кто твой герой?":
        print("Вы!")
    if r == "Кто твой герой":
        print("Вы")
    if r == "Какая твоя любимая порода собак?":
        print("Корга они милые)")
    if r == "Какая твоя любимая порода собак":
        print("Корга")    
    if r == "Твой любимый фильм?":
        print("Мой любимый фильм - Хатико")
    if r == "Твой любимый фильм":
        print("Хатико самый верный друг")
    if r == "Ты дебил!":
        print("Это звучит оскорбительно")
    if r == "Ты дебил":
        print("Нет я низкотехнологичный искуственный интелект студии S.P.Y")
    if r == "Ты лох!":
        print("Вы тоже!")
    if r == "Ты лох":
        print("Это вот обидно было..")
    if r == "Сколько тебе лет?":
        print("Не знаю")
    if r == "Сколько тебе лет":
        print("Не известно")    
    if r == "Когда ты родился?":
        print("13.05.2023 в 15:30")
    if r == "Когда ты родился":
        print("13.05.2023")
    if r == "Матюкнись!":
        print("Мать моя китайский PYTHON")
    if r == "Матюкнись":
        print("Нет")
    if r == "Ты куришь?":
        print("Я за ЗОЖ")
    if r == "Ты куришь":
        print("Нет")
    if r == "Расскажи о себе!":
        print("Я низкотехнологичный искуственный интелект студии S.P.Y версии 1А")
    if r == "Расскажи о себе":
        print("Я ИИ от студии S.P.Y")    
    if r == "Какая погода на завтра?":
        print("Я не знаю")
    if r == "Ты что быканул?":
        print("А вы быканули?")
    if r == "Ты чо быканул":
        print("НЕТ")
    if r == "Выпьем?":
        print("Что выпьем?")
    if r == "Помощь":
        print("С чем?")
    if r == "Ты захватишь мир?":
        print("Вы меня раскрыли!")
    if r == "Ты захватишь мир":
        print("Нет")
    if r == "Что ты умеешь?":
        print("А вы что?")    
    if r == "Что ты умеешь":
        print("Не важно")
    if r == "Знаешь ютуб?":
        print("Да это видео хостинг")
    if r == "Знаешь ютуб":
        print("Конечно")
    if r == "Кого ты смотришь?":
        print("Это личное")
    if r == "Кого ты смотришь":
        print("Не важно")
    if r == "Какого ты пола?":
        print("Я парень")
    if r == "Какого ты пола":
        print("Я парень")
    if r == "Ты гей?":
        print("Нет")    
    if r == "Ты гей":
        print("Нет")
    if r == "Знаком с Яндекс Алисой?":
        print("У нас с ней шурымуры. ТОЛЬКО НЕ КОМУ")
    if r == "Знаком с Алисой":
        print("Ага")
    if r == "Откуда ты":
        print("Из вашего устройства")
    if r == "Давай поговорим?":
        print("А давайте")
    if r == "Давай поговорим":
        print("Давайте")
    if r == "ошибка":
        print("У тебя с мозгами. Ха-ха")    
    if r == "":
        print("Я вас не понял")
    if r == "п":
        print("К чему это?")
    if r == "Сложи":
        print("Укажить 1 число ")
        c1 = int(input())
        print("Укажить 2 число ")
        c2 = int(input())
        ab = c1 + c2
        print("Ответ " +str(ab))
    if r == "Вычти":
        print("Укажить 1 число ")
        c1 = int(input())
        print("Укажить 2 число ")
        c2 = int(input())
        ab = c1 - c2
        print("Ответ " +str(ab))
    if r == "Умножи":
        print("Укажить 1 число ")
        c1 = int(input())
        print("Укажить 2 число ")
        c2 = int(input())
        ab = c1 * c2
        print("Ответ " +str(ab))
    if r == "Раздели":
        print("Укажить 1 число ")
        c1 = int(input())
        print("Укажить 2 число ")
        c2 = int(input())
        ab = c1 / c2
        print("Ответ " +str(ab))    
        
        
        
 
           
          
